In [1]:
import sqlalchemy as sa

In [2]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/Employees')
%load_ext sql
%sql $engine.url

## GROUP BY

In [3]:
%%sql 
SELECT dept_no, COUNT(emp_no)
FROM dept_emp
GROUP BY dept_no

 * postgresql://postgres:***@localhost:5432/Employees
9 rows affected.

[('d001', 20211),
 ('d002', 17346),
 ('d003', 17786),
 ('d004', 73485),
 ('d005', 85707),
 ('d006', 20117),
 ('d007', 52245),
 ('d008', 21126),
 ('d009', 23580)]

In [4]:
%%sql 

/*
*  How many people were hired on did we hire on any given hire date?
*  Database: Employees
*  Table: Employees
*/

SELECT hire_date, COUNT(emp_no) as "amount"
FROM employees
GROUP BY hire_date
ORDER BY "amount" DESC
LIMIT 5

 * postgresql://postgres:***@localhost:5432/Employees
5 rows affected.

[(datetime.date(1985, 6, 20), 132),
 (datetime.date(1985, 3, 21), 131),
 (datetime.date(1985, 8, 8), 128),
 (datetime.date(1985, 3, 24), 128),
 (datetime.date(1985, 12, 12), 127)]

In [5]:
%%sql 

/*
*  Show me all the employees, hired after 1991 and count the amount of positions they've had
*  Database: Employees
*/

SELECT e.emp_no, count(t.title) as "amount of titles"
FROM employees as e
JOIN titles as t USING(emp_no)
WHERE EXTRACT (YEAR FROM e.hire_date) > 1991
GROUP BY e.emp_no
ORDER BY e.emp_no
LIMIT 5

 * postgresql://postgres:***@localhost:5432/Employees
5 rows affected.

[(10008, 1), (10012, 2), (10016, 1), (10017, 2), (10019, 1)]

In [6]:
%%sql 

/*
*  Show me all the employees that work in the department development and the from and to date.
*  Database: Employees
*/
SELECT e.emp_no, de.from_date, de.to_date
FROM employees as e
JOIN dept_emp AS de USING(emp_no)
WHERE de.dept_no = 'd005'
GROUP BY e.emp_no, de.from_date, de.to_date
ORDER BY e.emp_no, de.to_date
LIMIT 5

 * postgresql://postgres:***@localhost:5432/Employees
5 rows affected.

[(10001, datetime.date(1986, 6, 26), datetime.date(9999, 1, 1)),
 (10006, datetime.date(1990, 8, 5), datetime.date(9999, 1, 1)),
 (10008, datetime.date(1998, 3, 11), datetime.date(2000, 7, 31)),
 (10012, datetime.date(1992, 12, 18), datetime.date(9999, 1, 1)),
 (10014, datetime.date(1993, 12, 29), datetime.date(9999, 1, 1))]

In [7]:
%%sql 

SELECT d.dept_name, COUNT(e.emp_no) AS "# of employees"
FROM employees AS e
iNNER JOIN dept_emp AS de ON de.emp_no = e.emp_no
INNER JOIN departments AS d ON de.dept_no = d.dept_no
-- WHERE e.gender = 'F'
GROUP BY d.dept_name
HAVING count(e.emp_no) > 25000

 * postgresql://postgres:***@localhost:5432/Employees
3 rows affected.

[('Development', 85707), ('Production', 73485), ('Sales', 52245)]

In [8]:
%%sql 

/*
*  Show me all the employees, hired after 1991, that have had more than 2 titles
*  Database: Employees
*/

SELECT e.emp_no, count(t.title) as "amount of titles"
FROM employees as e
JOIN titles as t USING(emp_no)
WHERE EXTRACT (YEAR FROM e.hire_date) > 1991
GROUP BY e.emp_no
HAVING count(t.title) > 2
ORDER BY e.emp_no
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/Employees
5 rows affected.

[(13251, 3), (21695, 3), (25429, 3), (27121, 3), (27803, 3)]

In [9]:
%%sql 

/*
*  Show me all the employees that have had more than 15 salary changes that work in the department development
*  Database: Employees
*/

SELECT e.emp_no, count(s.from_date) as "amount of raises"
FROM employees as e
JOIN salaries as s USING(emp_no)
JOIN dept_emp AS de USING(emp_no)
WHERE de.dept_no = 'd005'
GROUP BY e.emp_no
HAVING count(s.from_date) > 15
ORDER BY e.emp_no

LIMIT 5;

 * postgresql://postgres:***@localhost:5432/Employees
5 rows affected.

[(10001, 17), (10018, 16), (10066, 17), (10070, 17), (10150, 16)]

In [10]:
%%sql 

/*
*  Show me all the employees that have worked for multiple departments
*  Database: Employees
*/

SELECT e.emp_no, count(de.dept_no) as "worked for # departments"
FROM employees as e
JOIN dept_emp AS de USING(emp_no)
GROUP BY e.emp_no
HAVING count(de.dept_no) > 1
ORDER BY e.emp_no
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/Employees
5 rows affected.

[(10010, 2), (10018, 2), (10029, 2), (10040, 2), (10050, 2)]

In [11]:
%%sql 

-- ORDER BY for group
SELECT d.dept_name, COUNT(e.emp_no) AS "# of employees"
FROM employees AS e
iNNER JOIN dept_emp AS de ON de.emp_no = e.emp_no
INNER JOIN departments AS d ON de.dept_no = d.dept_no
WHERE e.gender = 'F'
GROUP BY d.dept_name
-- HAVING count(e.emp_no) > 25000
ORDER BY "# of employees" DESC

 * postgresql://postgres:***@localhost:5432/Employees
9 rows affected.

[('Development', 34258),
 ('Production', 29549),
 ('Sales', 20854),
 ('Customer Service', 9448),
 ('Research', 8439),
 ('Quality Management', 8078),
 ('Marketing', 8037),
 ('Human Resources', 7075),
 ('Finance', 7015)]

## Grouping Set

### UNION

In [12]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/Store')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [13]:
%%sql 

SELECT NULL AS "prod_id", SUM(ol.quantity)
FROM orderlines AS ol

UNION

SELECT prod_id AS "prod_id", sum(ol.quantity)
FROM orderlines AS ol
GROUP BY prod_id
ORDER BY prod_id DESC
LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/Store
5 rows affected.

[(None, 120719), (10000, 9), (9999, 13), (9998, 3), (9997, 16)]

In [14]:
%%sql

-- same as the above cell

SELECT prod_id AS "prod_id", sum(ol.quantity)
FROM orderlines AS ol
GROUP BY 
  GROUPING SETS (
    (),
    (prod_id)
  )
ORDER BY prod_id DESC
LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/Store
5 rows affected.

[(None, 120719), (10000, 9), (9999, 13), (9998, 3), (9997, 16)]

In [15]:
%%sql

SELECT  EXTRACT (YEAR FROM orderdate) AS "year",
        EXTRACT (MONTH FROM orderdate) AS "month",
        EXTRACT (DAY FROM orderdate) AS "day",
        SUM(ol.quantity)
FROM orderlines AS ol
GROUP BY
    GROUPING SETS (
        (EXTRACT (YEAR FROM orderdate)),
        (
            EXTRACT (YEAR FROM orderdate),
            EXTRACT (MONTH FROM orderdate)
        ),
        (
            EXTRACT (YEAR FROM orderdate),
            EXTRACT (MONTH FROM orderdate),
            EXTRACT (DAY FROM orderdate)
        ),
        (
            EXTRACT (MONTH FROM orderdate),
            EXTRACT (DAY FROM orderdate)
        ),
        (EXTRACT (MONTH FROM orderdate)),
        (EXTRACT (DAY FROM orderdate)),
        ()
    )

-- apply `HAVING` to reduce number of output
HAVING  (EXTRACT (YEAR FROM orderdate) = 2004 OR EXTRACT (YEAR FROM orderdate) IS NULL) AND
        (EXTRACT (MONTH FROM orderdate) = 1 OR EXTRACT (MONTH FROM orderdate) IS NULL)
ORDER BY
    EXTRACT (YEAR FROM orderdate),
    EXTRACT (MONTH FROM orderdate),
    EXTRACT (DAY FROM orderdate)

-- return SUM(ol.quantity) of
-- specific year, month, day
-- specific year, month
-- specific year
-- specific month, day
-- specific day
-- total

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/Store
97 rows affected.

[(Decimal('2004'), Decimal('1'), Decimal('1'), 329),
 (Decimal('2004'), Decimal('1'), Decimal('2'), 266),
 (Decimal('2004'), Decimal('1'), Decimal('3'), 315),
 (Decimal('2004'), Decimal('1'), Decimal('4'), 351),
 (Decimal('2004'), Decimal('1'), Decimal('5'), 420),
 (Decimal('2004'), Decimal('1'), Decimal('6'), 279),
 (Decimal('2004'), Decimal('1'), Decimal('7'), 300),
 (Decimal('2004'), Decimal('1'), Decimal('8'), 368),
 (Decimal('2004'), Decimal('1'), Decimal('9'), 347),
 (Decimal('2004'), Decimal('1'), Decimal('10'), 330),
 (Decimal('2004'), Decimal('1'), Decimal('11'), 510),
 (Decimal('2004'), Decimal('1'), Decimal('12'), 233),
 (Decimal('2004'), Decimal('1'), Decimal('13'), 234),
 (Decimal('2004'), Decimal('1'), Decimal('14'), 323),
 (Decimal('2004'), Decimal('1'), Decimal('15'), 428),
 (Decimal('2004'), Decimal('1'), Decimal('16'), 390),
 (Decimal('2004'), Decimal('1'), Decimal('17'), 327),
 (Decimal('2004'), Decimal('1'), Decimal('18'), 296),
 (Decimal('2004'), Decimal('1'), Decimal('19'), 236),
 (Decimal('2004'), Decimal('1'), Decimal('20'), 297),
 (Decimal('2004'), Decimal('1'), Decimal('21'), 273),
 (Decimal('2004'), Decimal('1'), Decimal('22'), 259),
 (Decimal('2004'), Decimal('1'), Decimal('23'), 383),
 (Decimal('2004'), Decimal('1'), Decimal('24'), 340),
 (Decimal('2004'), Decimal('1'), Decimal('25'), 231),
 (Decimal('2004'), Decimal('1'), Decimal('26'), 288),
 (Decimal('2004'), Decimal('1'), Decimal('27'), 392),
 (Decimal('2004'), Decimal('1'), Decimal('28'), 358),
 (Decimal('2004'), Decimal('1'), Decimal('29'), 306),
 (Decimal('2004'), Decimal('1'), Decimal('30'), 349),
 (Decimal('2004'), Decimal('1'), Decimal('31'), 332),
 (Decimal('2004'), Decimal('1'), None, 10090),
 (Decimal('2004'), None, None, 120719),
 (None, Decimal('1'), Decimal('1'), 329),
 (None, Decimal('1'), Decimal('2'), 266),
 (None, Decimal('1'), Decimal('3'), 315),
 (None, Decimal('1'), Decimal('4'), 351),
 (None, Decimal('1'), Decimal('5'), 420),
 (None, Decimal('1'), Decimal('6'), 279),
 (None, Decimal('1'), Decimal('7'), 300),
 (None, Decimal('1'), Decimal('8'), 368),
 (None, Decimal('1'), Decimal('9'), 347),
 (None, Decimal('1'), Decimal('10'), 330),
 (None, Decimal('1'), Decimal('11'), 510),
 (None, Decimal('1'), Decimal('12'), 233),
 (None, Decimal('1'), Decimal('13'), 234),
 (None, Decimal('1'), Decimal('14'), 323),
 (None, Decimal('1'), Decimal('15'), 428),
 (None, Decimal('1'), Decimal('16'), 390),
 (None, Decimal('1'), Decimal('17'), 327),
 (None, Decimal('1'), Decimal('18'), 296),
 (None, Decimal('1'), Decimal('19'), 236),
 (None, Decimal('1'), Decimal('20'), 297),
 (None, Decimal('1'), Decimal('21'), 273),
 (None, Decimal('1'), Decimal('22'), 259),
 (None, Decimal('1'), Decimal('23'), 383),
 (None, Decimal('1'), Decimal('24'), 340),
 (None, Decimal('1'), Decimal('25'), 231),
 (None, Decimal('1'), Decimal('26'), 288),
 (None, Decimal('1'), Decimal('27'), 392),
 (None, Decimal('1'), Decimal('28'), 358),
 (None, Decimal('1'), Decimal('29'), 306),
 (None, Decimal('1'), Decimal('30'), 349),
 (None, Decimal('1'), Decimal('31'), 332),
 (None, Decimal('1'), None, 10090),
 (None, None, Decimal('1'), 3967),
 (None, None, Decimal('2'), 3754),
 (None, None, Decimal('3'), 3942),
 (None, None, Decimal('4'), 4110),
 (None, None, Decimal('5'), 4020),
 (None, None, Decimal('6'), 3787),
 (None, None, Decimal('7'), 3702),
 (None, None, Decimal('8'), 4113),
 (None, None, Decimal('9'), 4033),
 (None, None, Decimal('10'), 3940),
 (None, None, Decimal('11'), 4131),
 (None, None, Decimal('12'), 3633),
 (None, None, Decimal('13'), 3428),
 (None, None, Decimal('14'), 3958),
 (None, None, Decimal('15'), 3781),
 (None, None, Decimal('16'), 3879),
 (None, None, Decimal('17'), 4254),
 (None, None, Decimal('18'), 4132),
 (None, None, Decimal('19'), 3490),
 (None, None, Decimal('20'), 4228),
 (None, None, Decimal('21'), 3951),
 (None, None, Decimal('22'), 3774),
 (None, None, Decimal('23'), 3833),
 (None, None, Decimal('24'), 4216),
 (None, None, Decimal('25'), 4004),
 (None, None, Decimal('26'), 4144),
 (None, None, Decimal('27'), 4386),
 (None, None, Decimal('28'), 4283),
 (None, None, Decimal('29'), 3646),
 (None, None, Decimal('30'), 3877),
 (None, None, Decimal('31'), 2323),
 (None, None, None, 120719)]

In [16]:
%%sql

-- same as above cell using `ROLLUP`

SELECT  EXTRACT (YEAR FROM orderdate) AS "year",
        EXTRACT (MONTH FROM orderdate) AS "month",
        EXTRACT (DAY FROM orderdate) AS "day",
        SUM(ol.quantity)
FROM orderlines AS ol
GROUP BY
    ROLLUP (
        EXTRACT (YEAR FROM orderdate),
        EXTRACT (MONTH FROM orderdate),
        EXTRACT (DAY FROM orderdate)
    )

-- apply `HAVING` to reduce number of output
HAVING  (EXTRACT (YEAR FROM orderdate) = 2004 OR EXTRACT (YEAR FROM orderdate) IS NULL) AND
        (EXTRACT (MONTH FROM orderdate) = 1 OR EXTRACT (MONTH FROM orderdate) IS NULL)
ORDER BY
    EXTRACT (YEAR FROM orderdate),
    EXTRACT (MONTH FROM orderdate),
    EXTRACT (DAY FROM orderdate)

-- return SUM(ol.quantity) of
-- specific year, month, day
-- specific year, month
-- specific year
-- specific month, day
-- specific day
-- total

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/Store
34 rows affected.

[(Decimal('2004'), Decimal('1'), Decimal('1'), 329),
 (Decimal('2004'), Decimal('1'), Decimal('2'), 266),
 (Decimal('2004'), Decimal('1'), Decimal('3'), 315),
 (Decimal('2004'), Decimal('1'), Decimal('4'), 351),
 (Decimal('2004'), Decimal('1'), Decimal('5'), 420),
 (Decimal('2004'), Decimal('1'), Decimal('6'), 279),
 (Decimal('2004'), Decimal('1'), Decimal('7'), 300),
 (Decimal('2004'), Decimal('1'), Decimal('8'), 368),
 (Decimal('2004'), Decimal('1'), Decimal('9'), 347),
 (Decimal('2004'), Decimal('1'), Decimal('10'), 330),
 (Decimal('2004'), Decimal('1'), Decimal('11'), 510),
 (Decimal('2004'), Decimal('1'), Decimal('12'), 233),
 (Decimal('2004'), Decimal('1'), Decimal('13'), 234),
 (Decimal('2004'), Decimal('1'), Decimal('14'), 323),
 (Decimal('2004'), Decimal('1'), Decimal('15'), 428),
 (Decimal('2004'), Decimal('1'), Decimal('16'), 390),
 (Decimal('2004'), Decimal('1'), Decimal('17'), 327),
 (Decimal('2004'), Decimal('1'), Decimal('18'), 296),
 (Decimal('2004'), Decimal('1'), Decimal('19'), 236),
 (Decimal('2004'), Decimal('1'), Decimal('20'), 297),
 (Decimal('2004'), Decimal('1'), Decimal('21'), 273),
 (Decimal('2004'), Decimal('1'), Decimal('22'), 259),
 (Decimal('2004'), Decimal('1'), Decimal('23'), 383),
 (Decimal('2004'), Decimal('1'), Decimal('24'), 340),
 (Decimal('2004'), Decimal('1'), Decimal('25'), 231),
 (Decimal('2004'), Decimal('1'), Decimal('26'), 288),
 (Decimal('2004'), Decimal('1'), Decimal('27'), 392),
 (Decimal('2004'), Decimal('1'), Decimal('28'), 358),
 (Decimal('2004'), Decimal('1'), Decimal('29'), 306),
 (Decimal('2004'), Decimal('1'), Decimal('30'), 349),
 (Decimal('2004'), Decimal('1'), Decimal('31'), 332),
 (Decimal('2004'), Decimal('1'), None, 10090),
 (Decimal('2004'), None, None, 120719),
 (None, None, None, 120719)]

## Window Functions

In [17]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/Employees')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [18]:
%%sql

SELECT 
    *,
    MAX(salary) OVER ()
FROM salaries
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
10 rows affected.

[(10001, 60117, datetime.date(1986, 6, 26), datetime.date(1987, 6, 26), 158220),
 (10001, 62102, datetime.date(1987, 6, 26), datetime.date(1988, 6, 25), 158220),
 (10001, 66074, datetime.date(1988, 6, 25), datetime.date(1989, 6, 25), 158220),
 (10001, 66596, datetime.date(1989, 6, 25), datetime.date(1990, 6, 25), 158220),
 (10001, 66961, datetime.date(1990, 6, 25), datetime.date(1991, 6, 25), 158220),
 (10001, 71046, datetime.date(1991, 6, 25), datetime.date(1992, 6, 24), 158220),
 (10001, 74333, datetime.date(1992, 6, 24), datetime.date(1993, 6, 24), 158220),
 (10001, 75286, datetime.date(1993, 6, 24), datetime.date(1994, 6, 24), 158220),
 (10001, 75994, datetime.date(1994, 6, 24), datetime.date(1995, 6, 24), 158220),
 (10001, 76884, datetime.date(1995, 6, 24), datetime.date(1996, 6, 23), 158220)]

### PARTITION BY Keyword

In [19]:
%%sql

SELECT 
    *,
    AVG(salary) OVER (
        PARTITION BY d.dept_name
    )
FROM salaries
JOIN dept_emp AS de USING (emp_no)
JOIN departments AS d USING (dept_no)
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
10 rows affected.

[('d009', 10011, 42365, datetime.date(1990, 1, 22), datetime.date(1991, 1, 22), datetime.date(1990, 1, 22), datetime.date(1996, 11, 9), 'Customer Service', Decimal('58770.366479762480')),
 ('d009', 10011, 44200, datetime.date(1991, 1, 22), datetime.date(1992, 1, 22), datetime.date(1990, 1, 22), datetime.date(1996, 11, 9), 'Customer Service', Decimal('58770.366479762480')),
 ('d009', 10011, 48214, datetime.date(1992, 1, 22), datetime.date(1993, 1, 21), datetime.date(1990, 1, 22), datetime.date(1996, 11, 9), 'Customer Service', Decimal('58770.366479762480')),
 ('d009', 10011, 50927, datetime.date(1993, 1, 21), datetime.date(1994, 1, 21), datetime.date(1990, 1, 22), datetime.date(1996, 11, 9), 'Customer Service', Decimal('58770.366479762480')),
 ('d009', 10011, 51470, datetime.date(1994, 1, 21), datetime.date(1995, 1, 21), datetime.date(1990, 1, 22), datetime.date(1996, 11, 9), 'Customer Service', Decimal('58770.366479762480')),
 ('d009', 10011, 54545, datetime.date(1995, 1, 21), datetime.date(1996, 1, 21), datetime.date(1990, 1, 22), datetime.date(1996, 11, 9), 'Customer Service', Decimal('58770.366479762480')),
 ('d009', 10011, 56753, datetime.date(1996, 1, 21), datetime.date(1996, 11, 9), datetime.date(1990, 1, 22), datetime.date(1996, 11, 9), 'Customer Service', Decimal('58770.366479762480')),
 ('d009', 10038, 40000, datetime.date(1989, 9, 20), datetime.date(1990, 9, 20), datetime.date(1989, 9, 20), datetime.date(9999, 1, 1), 'Customer Service', Decimal('58770.366479762480')),
 ('d009', 10038, 43527, datetime.date(1990, 9, 20), datetime.date(1991, 9, 20), datetime.date(1989, 9, 20), datetime.date(9999, 1, 1), 'Customer Service', Decimal('58770.366479762480')),
 ('d009', 10038, 46509, datetime.date(1991, 9, 20), datetime.date(1992, 9, 19), datetime.date(1989, 9, 20), datetime.date(9999, 1, 1), 'Customer Service', Decimal('58770.366479762480'))]

### ORDER BY Keyword

In [20]:
%%sql

SELECT 
    emp_no,
    salary,
    COUNT(salary) OVER(
--         ORDER BY emp_no
    )
FROM salaries
LIMIT 5

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
5 rows affected.

[(10001, 60117, 2844047),
 (10001, 62102, 2844047),
 (10001, 66074, 2844047),
 (10001, 66596, 2844047),
 (10001, 66961, 2844047)]

In [21]:
%%sql

-- order by change the frame of window function (to cumulative)

SELECT 
    emp_no,
    salary,
    COUNT(salary) OVER(
        ORDER BY emp_no
    )
FROM salaries
LIMIT 30

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
30 rows affected.

[(10001, 60117, 17),
 (10001, 62102, 17),
 (10001, 66074, 17),
 (10001, 66596, 17),
 (10001, 66961, 17),
 (10001, 71046, 17),
 (10001, 74333, 17),
 (10001, 75286, 17),
 (10001, 75994, 17),
 (10001, 76884, 17),
 (10001, 80013, 17),
 (10001, 81025, 17),
 (10001, 81097, 17),
 (10001, 84917, 17),
 (10001, 85112, 17),
 (10001, 85097, 17),
 (10001, 88958, 17),
 (10002, 65828, 23),
 (10002, 65909, 23),
 (10002, 67534, 23),
 (10002, 69366, 23),
 (10002, 71963, 23),
 (10002, 72527, 23),
 (10003, 40006, 30),
 (10003, 43616, 30),
 (10003, 43466, 30),
 (10003, 43636, 30),
 (10003, 43478, 30),
 (10003, 43699, 30),
 (10003, 43311, 30)]

In [22]:
%%sql

SELECT 
    emp_no,
    salary,
    COUNT(salary) OVER(
        PARTITION BY emp_no
        ORDER BY emp_no
    )
 FROM salaries
 LIMIT 20

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
20 rows affected.

[(10001, 60117, 17),
 (10001, 62102, 17),
 (10001, 66074, 17),
 (10001, 66596, 17),
 (10001, 66961, 17),
 (10001, 71046, 17),
 (10001, 74333, 17),
 (10001, 75286, 17),
 (10001, 75994, 17),
 (10001, 76884, 17),
 (10001, 80013, 17),
 (10001, 81025, 17),
 (10001, 81097, 17),
 (10001, 84917, 17),
 (10001, 85112, 17),
 (10001, 85097, 17),
 (10001, 88958, 17),
 (10002, 65828, 6),
 (10002, 65909, 6),
 (10002, 67534, 6)]

In [23]:
%%sql

SELECT 
    emp_no,
    salary,
    COUNT(salary) OVER(
        PARTITION BY emp_no
        ORDER BY salary
    )
 FROM salaries
 LIMIT 20

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
20 rows affected.

[(10001, 60117, 1),
 (10001, 62102, 2),
 (10001, 66074, 3),
 (10001, 66596, 4),
 (10001, 66961, 5),
 (10001, 71046, 6),
 (10001, 74333, 7),
 (10001, 75286, 8),
 (10001, 75994, 9),
 (10001, 76884, 10),
 (10001, 80013, 11),
 (10001, 81025, 12),
 (10001, 81097, 13),
 (10001, 84917, 14),
 (10001, 85097, 15),
 (10001, 85112, 16),
 (10001, 88958, 17),
 (10002, 65828, 1),
 (10002, 65909, 2),
 (10002, 67534, 3)]

In [24]:
%%sql

SELECT 
    emp_no,
    salary,
    COUNT(salary) OVER(
        PARTITION BY emp_no
        ORDER BY salary
        RANGE BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING
    )
 FROM salaries
 LIMIT 20

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
20 rows affected.

[(10001, 60117, 17),
 (10001, 62102, 17),
 (10001, 66074, 17),
 (10001, 66596, 17),
 (10001, 66961, 17),
 (10001, 71046, 17),
 (10001, 74333, 17),
 (10001, 75286, 17),
 (10001, 75994, 17),
 (10001, 76884, 17),
 (10001, 80013, 17),
 (10001, 81025, 17),
 (10001, 81097, 17),
 (10001, 84917, 17),
 (10001, 85097, 17),
 (10001, 85112, 17),
 (10001, 88958, 17),
 (10002, 65828, 6),
 (10002, 65909, 6),
 (10002, 67534, 6)]

In [25]:
%%sql

SELECT  DISTINCT e.emp_no,
        e.first_name,
        d.dept_name,
        LAST_VALUE(s.salary) OVER (
            PARTITION BY e.emp_no
            ORDER BY s.from_date
            RANGE BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING
        ) as "Current Salary"

FROM salaries as s

JOIN employees AS e USING(emp_no)
JOIN dept_emp AS de USING(emp_no)
JOIN departments AS d USING(dept_no)

ORDER BY e.emp_no

LIMIT 50

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
50 rows affected.

[(10001, 'Georgi', 'Development', 88958),
 (10002, 'Bezalel', 'Sales', 72527),
 (10003, 'Parto', 'Production', 43311),
 (10004, 'Chirstian', 'Production', 74057),
 (10005, 'Kyoichi', 'Human Resources', 94692),
 (10006, 'Anneke', 'Development', 59755),
 (10007, 'Tzvetan', 'Research', 88070),
 (10008, 'Saniya', 'Development', 52668),
 (10009, 'Sumant', 'Quality Management', 94409),
 (10010, 'Duangkaew', 'Production', 80324),
 (10010, 'Duangkaew', 'Quality Management', 80324),
 (10011, 'Mary', 'Customer Service', 56753),
 (10012, 'Patricio', 'Development', 54423),
 (10013, 'Eberhardt', 'Human Resources', 68901),
 (10014, 'Berni', 'Development', 60598),
 (10015, 'Guoxiang', 'Research', 40000),
 (10016, 'Kazuhito', 'Sales', 77935),
 (10017, 'Cristinel', 'Marketing', 99651),
 (10018, 'Kazuhide', 'Development', 84672),
 (10018, 'Kazuhide', 'Production', 84672),
 (10019, 'Lillian', 'Research', 50032),
 (10020, 'Mayuko', 'Production', 47017),
 (10021, 'Ramzi', 'Development', 84169),
 (10022, 'Shahaf', 'Development', 41348),
 (10023, 'Bojan', 'Development', 50113),
 (10024, 'Suzette', 'Production', 96646),
 (10025, 'Prasadram', 'Development', 57157),
 (10026, 'Yongqiao', 'Production', 66313),
 (10027, 'Divier', 'Development', 46145),
 (10028, 'Domenick', 'Development', 58502),
 (10029, 'Otmar', 'Production', 77777),
 (10029, 'Otmar', 'Quality Management', 77777),
 (10030, 'Elvis', 'Production', 88806),
 (10031, 'Karsten', 'Development', 56689),
 (10032, 'Jeong', 'Production', 69539),
 (10033, 'Arif', 'Quality Management', 60433),
 (10034, 'Bader', 'Sales', 53164),
 (10035, 'Alain', 'Production', 68755),
 (10036, 'Adamantios', 'Human Resources', 63053),
 (10037, 'Pradeep', 'Development', 60574),
 (10038, 'Huan', 'Customer Service', 64254),
 (10039, 'Alejandro', 'Human Resources', 63918),
 (10040, 'Weiyi', 'Development', 72668),
 (10040, 'Weiyi', 'Research', 72668),
 (10041, 'Uri', 'Sales', 81705),
 (10042, 'Magy', 'Finance', 94868),
 (10043, 'Yishay', 'Development', 77659),
 (10044, 'Mingsen', 'Production', 58345),
 (10045, 'Moss', 'Production', 47581),
 (10046, 'Lucien', 'Research', 62218)]

## Functions

### FIRST_VALUE function

In [26]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/Store')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [27]:
%%sql

SELECT
  prod_id,
  price,
  category,
  -- sort by price and get the first price. thus get the lowest price
  FIRST_VALUE(price) OVER(
    PARTITION BY category ORDER BY price RANGE BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWiNG
  ) as "cheapest in category"
FROM products
LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/Store
5 rows affected.

[(9214, Decimal('9.99'), 1, Decimal('9.99')),
 (5977, Decimal('9.99'), 1, Decimal('9.99')),
 (4161, Decimal('9.99'), 1, Decimal('9.99')),
 (472, Decimal('9.99'), 1, Decimal('9.99')),
 (886, Decimal('9.99'), 1, Decimal('9.99'))]

In [28]:
%%sql

SELECT
  prod_id,
  price,
  category,
  -- sort by price and get the first price. thus get the lowest price
  MIN(price) OVER(PARTITION BY category) as "cheapest in category"
FROM products
LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/Store
5 rows affected.

[(28, Decimal('13.99'), 1, Decimal('9.99')),
 (96, Decimal('21.99'), 1, Decimal('9.99')),
 (126, Decimal('21.99'), 1, Decimal('9.99')),
 (142, Decimal('18.99'), 1, Decimal('9.99')),
 (163, Decimal('25.99'), 1, Decimal('9.99'))]

### LAST_VALUE function

In [29]:
%%sql

SELECT
  prod_id,
  price,
  category,
  LAST_VALUE(price) OVER(
    PARTITION BY category ORDER BY price RANGE BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWiNG
  ) as "most expensive in category"
FROM products
LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/Store
5 rows affected.

[(9214, Decimal('9.99'), 1, Decimal('29.99')),
 (5977, Decimal('9.99'), 1, Decimal('29.99')),
 (4161, Decimal('9.99'), 1, Decimal('29.99')),
 (472, Decimal('9.99'), 1, Decimal('29.99')),
 (886, Decimal('9.99'), 1, Decimal('29.99'))]

### SUM function

In [30]:
%%sql

SELECT 
  o.orderid,
  o.customerid,
  o.netamount,
  SUM(o.netamount) OVER(
    PARTITION BY o.customerid 
    ORDER BY o.orderid
  ) as "cum sum"
FROM orders as o
ORDER BY o.customerid

LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/Store
5 rows affected.

[(10677, 2, Decimal('5.08'), Decimal('5.08')),
 (2337, 3, Decimal('39.06'), Decimal('39.06')),
 (9077, 6, Decimal('323.30'), Decimal('323.30')),
 (6239, 7, Decimal('341.44'), Decimal('341.44')),
 (1187, 11, Decimal('285.39'), Decimal('285.39'))]

### ROW_NUMBER

In [31]:
%%sql

SELECT
  prod_id,
  price,
  category,
  row_number() OVER(PARTITION BY category ORDER BY price) AS "position in category by price"
FROM products
LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/Store
5 rows affected.

[(9214, Decimal('9.99'), 1, 1),
 (5977, Decimal('9.99'), 1, 2),
 (4161, Decimal('9.99'), 1, 3),
 (472, Decimal('9.99'), 1, 4),
 (886, Decimal('9.99'), 1, 5)]

In [32]:
%%sql

SELECT
  prod_id,
  price,
  category,
  row_number() OVER(
    PARTITION BY category ORDER BY price
    RANGE BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWiNG
  ) AS "position in category by price"
FROM products
LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/Store
5 rows affected.

[(9214, Decimal('9.99'), 1, 1),
 (5977, Decimal('9.99'), 1, 2),
 (4161, Decimal('9.99'), 1, 3),
 (472, Decimal('9.99'), 1, 4),
 (886, Decimal('9.99'), 1, 5)]

### Window Functions Exercise

In [33]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/World')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [34]:
%%sql

/*
*  Show the population per continent
*  Database: World
*  Table: Country
*/

SELECT
  DISTINCT continent,
  SUM(population) OVER w1 as"continent population"
FROM country 
WINDOW w1 AS( PARTITION BY continent )

   postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
 * postgresql://postgres:***@localhost:5432/World
7 rows affected.

[('South America', 345780000),
 ('Antarctica', 0),
 ('Oceania', 30401150),
 ('Asia', 3705025700),
 ('Africa', 784475000),
 ('North America', 482993000),
 ('Europe', 730074600)]

In [35]:
%%sql

/*
*  To the previous query add on the ability to calculate the percentage of the world population
*  What that means is that you will divide the population of that continent by the total population and multiply by 100 to get a percentage.
*  Make sure you convert the population numbers to float using `population::float` otherwise you may see zero pop up
*
*  Database: World
*  Table: Country
*/

SELECT
  DISTINCT continent,
  SUM(population) OVER w1 as"continent population",
  CONCAT( 
      ROUND( 
          ( 
            SUM( population::float4 ) OVER w1 / 
            SUM( population::float4 ) OVER() 
          ) * 100    
      ),'%' ) as "percentage of population"
FROM country 
WINDOW w1 AS( PARTITION BY continent );

   postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
 * postgresql://postgres:***@localhost:5432/World
7 rows affected.

[('Antarctica', 0, '0%'),
 ('Asia', 3705025700, '61%'),
 ('Europe', 730074600, '12%'),
 ('South America', 345780000, '6%'),
 ('Africa', 784475000, '13%'),
 ('Oceania', 30401150, '1%'),
 ('North America', 482993000, '8%')]

In [36]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/France')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [37]:
%%sql

/*
*  Count the number of towns per region
*
*  Database: France
*  Table: Regions (Join + Window function)
*/

SELECT 
DISTINCT r.id, 
r."name", 
COUNT(t.id) OVER (
    PARTITION BY r.id
    ORDER BY r."name"
) AS "# of towns"
FROM regions AS r
JOIN departments AS d ON r.code = d.region 
JOIN towns AS t ON d.code = t.department
ORDER BY r.id;

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/France
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
26 rows affected.

[(1, 'Guadeloupe', 34),
 (2, 'Martinique', 34),
 (3, 'Guyane', 22),
 (4, 'La Runion', 24),
 (5, 'le-de-France', 1281),
 (6, 'Champagne-Ardenne', 1948),
 (7, 'Picardie', 2292),
 (8, 'Haute-Normandie', 1420),
 (9, 'Centre', 1842),
 (10, 'Basse-Normandie', 1812),
 (11, 'Bourgogne', 2046),
 (12, 'Nord-Pas-de-Calais', 1546),
 (13, 'Lorraine', 2339),
 (14, 'Alsace', 903),
 (15, 'Franche-Comt', 1786),
 (16, 'Pays de la Loire', 1502),
 (17, 'Bretagne', 1269),
 (18, 'Poitou-Charentes', 1464),
 (19, 'Aquitaine', 2296),
 (20, 'Midi-Pyrnes', 3020),
 (21, 'Limousin', 747),
 (22, 'Rhne-Alpes', 2879),
 (23, 'Auvergne', 1310),
 (24, 'Languedoc-Roussillon', 1545),
 (25, "Provence-Alpes-Cte d'Azur", 963),
 (26, 'Corse', 360)]

## Conditional Statements

In [38]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/Store')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [39]:
%%sql

SELECT  o.orderid,
        o.customerid,
        o.netamount
FROM orders AS o
WHERE CASE WHEN o.customerid > 10
           THEN o.netamount < 100
           ELSE o.netamount > 100
           END
ORDER BY o.customerid

LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
 * postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[(9077, 6, Decimal('323.30')),
 (6239, 7, Decimal('341.44')),
 (9447, 13, Decimal('83.31')),
 (3075, 15, Decimal('33.63')),
 (9748, 19, Decimal('71.29'))]

In [40]:
%%sql

SELECT
  SUM(
    CASE
      WHEN o.netamount < 100
      THEN -100
      ELSE o.netamount
      END
  ) as "returns",
  SUM(o.netamount) as "normal total"
FROM orders AS o

   postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
 * postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
1 rows affected.

[(Decimal('1906961.25'), Decimal('2371719.74'))]

In [41]:
%%sql

/**
* Database: Store
* Table: products
* Create a case statement that's named "price class" where if a product is over 20 dollars you show 'expensive'
* if it's between 10 and 20 you show 'average' 
* and of is lower than or equal to 10 you show 'cheap'.
*/

SELECT prod_id, title, price, 
    CASE   
      WHEN  price > 20 THEN 'expensive'
      WHEN  price <= 10 THEN  'cheap'
      WHEN  price BETWEEN 10 and 20  THEN 'average'
    END AS "price class"
FROM products

LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
 * postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[(1, 'ACADEMY ACADEMY', Decimal('25.99'), 'expensive'),
 (2, 'ACADEMY ACE', Decimal('20.99'), 'expensive'),
 (3, 'ACADEMY ADAPTATION', Decimal('28.99'), 'expensive'),
 (4, 'ACADEMY AFFAIR', Decimal('14.99'), 'average'),
 (5, 'ACADEMY AFRICAN', Decimal('11.99'), 'average')]

## NULLIF function

In [42]:
%%sql

/*
* DB: Store
* Table: products
* Question: Show NULL when the product is not on special (0)
*/

SELECT prod_id, title, price, NULLIF(special, 0) as "special"
FROM products

LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
 * postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[(1, 'ACADEMY ACADEMY', Decimal('25.99'), None),
 (2, 'ACADEMY ACE', Decimal('20.99'), None),
 (3, 'ACADEMY ADAPTATION', Decimal('28.99'), None),
 (4, 'ACADEMY AFFAIR', Decimal('14.99'), None),
 (5, 'ACADEMY AFRICAN', Decimal('11.99'), 1)]

## VIEWS

In [43]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/Employees')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [44]:
%%sql

-- CREATE VIEW last_salary_change AS
CREATE OR REPLACE VIEW last_salary_change AS
SELECT  e.emp_no,
        MAX(s.from_date)
FROM salaries AS s

JOIN employees AS e USING(emp_no)
JOIN dept_emp AS de USING(emp_no)
JOIN departments AS d USING(dept_no)

GROUP BY e.emp_no
ORDER BY e.emp_no;

SELECT * FROM last_salary_change LIMIT 5;

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
Done.
5 rows affected.

[(10001, datetime.date(2002, 6, 22)),
 (10002, datetime.date(2001, 8, 2)),
 (10003, datetime.date(2001, 12, 1)),
 (10004, datetime.date(2001, 11, 27)),
 (10005, datetime.date(2001, 9, 9))]

In [48]:
%%sql

SELECT s.emp_no, d.dept_name, s.from_date, s.salary FROM last_salary_change

JOIN salaries AS s USING(emp_no)
JOIN dept_emp AS de USING(emp_no)
JOIN departments AS d USING(dept_no)


WHERE s.from_date = max
ORDER BY s.emp_no
LIMIT 10

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
10 rows affected.

[(10001, 'Development', datetime.date(2002, 6, 22), 88958),
 (10002, 'Sales', datetime.date(2001, 8, 2), 72527),
 (10003, 'Production', datetime.date(2001, 12, 1), 43311),
 (10004, 'Production', datetime.date(2001, 11, 27), 74057),
 (10005, 'Human Resources', datetime.date(2001, 9, 9), 94692),
 (10006, 'Development', datetime.date(2001, 8, 2), 59755),
 (10007, 'Research', datetime.date(2002, 2, 7), 88070),
 (10008, 'Development', datetime.date(2000, 3, 10), 52668),
 (10009, 'Quality Management', datetime.date(2002, 2, 14), 94409),
 (10010, 'Production', datetime.date(2001, 11, 23), 80324)]

### ViEWS exercise

In [49]:
%%sql

/*
*  Create a view "90-95" that:
*  Shows me all the employees, hired between 1990 and 1995
*  Database: Employees
*/

CREATE VIEW "90-95" AS
SELECT *
FROM employees as e
WHERE EXTRACT (YEAR FROM e.hire_date) BETWEEN 1990 AND 1995
ORDER BY e.emp_no;

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
Done.

[]

In [50]:
%%sql

/*
*  Create a view "bigbucks" that:
*  Shows me all employees that have ever had a salary over 80000
*  Database: Employees
*/

CREATE VIEW "bigbucks" AS
SELECT e.emp_no, s.salary
FROM employees as e
JOIN salaries as s USING(emp_no)
WHERE s.salary > 80000
ORDER BY s.salary;

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
Done.

[]

## Indexes

In [52]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/World')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [62]:
%%sql
DROP INDEX idx_countrycode

   postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
   postgresql://postgres:***@localhost:5432/Store
 * postgresql://postgres:***@localhost:5432/World
(psycopg2.errors.UndefinedObject) index "idx_countrycode" does not exist

[SQL: DROP INDEX idx_countrycode]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [63]:
%%sql

EXPLAIN ANALYSE
SELECT "name", district, countrycode FROM city
WHERE countrycode IN ('TUN', 'BE', 'NL')

   postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
   postgresql://postgres:***@localhost:5432/Store
 * postgresql://postgres:***@localhost:5432/World
5 rows affected.

[('Seq Scan on city  (cost=0.00..88.09 rows=11 width=23) (actual time=0.438..0.513 rows=8 loops=1)',),
 ("  Filter: (countrycode = ANY ('{TUN,BE,NL}'::bpchar[]))",),
 ('  Rows Removed by Filter: 4071',),
 ('Planning Time: 0.076 ms',),
 ('Execution Time: 0.524 ms',)]

In [64]:
%%sql

CREATE INDEX idx_countrycode
ON city (countrycode) WHERE countrycode IN ('TUN', 'BE', 'NL')

   postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
   postgresql://postgres:***@localhost:5432/Store
 * postgresql://postgres:***@localhost:5432/World
Done.

[]

In [65]:
%%sql

EXPLAIN ANALYSE
SELECT "name", district, countrycode FROM city
WHERE countrycode IN ('TUN', 'BE', 'NL')

   postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
   postgresql://postgres:***@localhost:5432/Store
 * postgresql://postgres:***@localhost:5432/World
6 rows affected.

[('Bitmap Heap Scan on city  (cost=8.18..31.56 rows=11 width=23) (actual time=0.017..0.018 rows=8 loops=1)',),
 ("  Recheck Cond: (countrycode = ANY ('{TUN,BE,NL}'::bpchar[]))",),
 ('  Heap Blocks: exact=1',),
 ('  ->  Bitmap Index Scan on idx_countrycode  (cost=0.00..8.17 rows=11 width=0) (actual time=0.013..0.013 rows=8 loops=1)',),
 ('Planning Time: 1.145 ms',),
 ('Execution Time: 0.038 ms',)]

In [66]:
%%sql
DROP INDEX idx_countrycode;
CREATE INDEX idx_countrycode
ON city (countrycode)

   postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
   postgresql://postgres:***@localhost:5432/Store
 * postgresql://postgres:***@localhost:5432/World
Done.
Done.

[]

In [67]:
%%sql

EXPLAIN ANALYSE
SELECT "name", district, countrycode FROM city
WHERE countrycode IN ('TUN', 'BE', 'NL')

   postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
   postgresql://postgres:***@localhost:5432/Store
 * postgresql://postgres:***@localhost:5432/World
7 rows affected.

[('Bitmap Heap Scan on city  (cost=12.93..36.31 rows=11 width=23) (actual time=0.146..0.148 rows=8 loops=1)',),
 ("  Recheck Cond: (countrycode = ANY ('{TUN,BE,NL}'::bpchar[]))",),
 ('  Heap Blocks: exact=1',),
 ('  ->  Bitmap Index Scan on idx_countrycode  (cost=0.00..12.93 rows=11 width=0) (actual time=0.137..0.137 rows=8 loops=1)',),
 ("        Index Cond: (countrycode = ANY ('{TUN,BE,NL}'::bpchar[]))",),
 ('Planning Time: 1.664 ms',),
 ('Execution Time: 0.196 ms',)]

## Subquery

In [69]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/Store')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [72]:
%%sql

-- Subqury
SELECT title, price, (SELECT AVG(price) FROM products) AS "global average price"
FROM products
LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
 * postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[('ACADEMY ACADEMY', Decimal('25.99'), Decimal('20.0151000000000000')),
 ('ACADEMY ACE', Decimal('20.99'), Decimal('20.0151000000000000')),
 ('ACADEMY ADAPTATION', Decimal('28.99'), Decimal('20.0151000000000000')),
 ('ACADEMY AFFAIR', Decimal('14.99'), Decimal('20.0151000000000000')),
 ('ACADEMY AFRICAN', Decimal('11.99'), Decimal('20.0151000000000000'))]

In [73]:
%%sql

-- Join
SELECT prod_id, title, price, quan_in_stock
FROM products
JOIN inventory USING(prod_id)
LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
 * postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[(1, 'ACADEMY ACADEMY', Decimal('25.99'), 138),
 (2, 'ACADEMY ACE', Decimal('20.99'), 118),
 (3, 'ACADEMY ADAPTATION', Decimal('28.99'), 228),
 (4, 'ACADEMY AFFAIR', Decimal('14.99'), 279),
 (5, 'ACADEMY AFRICAN', Decimal('11.99'), 382)]

In [74]:
%%sql

SELECT title, price, (SELECT AVG(price) FROM products) AS "global average price"
FROM (SELECT * FROM products WHERE price < 10) AS "products_sub"
LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
 * postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[('ACADEMY ALADDIN', Decimal('9.99'), Decimal('20.0151000000000000')),
 ('ACADEMY BILL', Decimal('9.99'), Decimal('20.0151000000000000')),
 ('ACADEMY BLACKOUT', Decimal('9.99'), Decimal('20.0151000000000000')),
 ('ACADEMY BLANKET', Decimal('9.99'), Decimal('20.0151000000000000')),
 ('ACADEMY CADDYSHACK', Decimal('9.99'), Decimal('20.0151000000000000'))]

In [75]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/Employees')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [77]:
%%sql
-- show all employees older than the average age
SELECT first_name, last_name, birth_date, AGE(birth_date)
FROM employees
WHERE AGE(birth_date) > (SELECT AVG(age(birth_date)) FROM employees)
LIMIT 5

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[('Georgi', 'Facello', datetime.date(1953, 9, 2), datetime.timedelta(days=25215)),
 ('Chirstian', 'Koblick', datetime.date(1954, 5, 1), datetime.timedelta(days=24971)),
 ('Kyoichi', 'Maliniak', datetime.date(1955, 1, 21), datetime.timedelta(days=24707)),
 ('Anneke', 'Preusig', datetime.date(1953, 4, 20), datetime.timedelta(days=25347)),
 ('Tzvetan', 'Zielinski', datetime.date(1957, 5, 23), datetime.timedelta(days=23855))]

In [83]:
%%sql
-- show the title by salary for each employee
SELECT 
    emp_no,
    salary,
    from_date,
    (
      SELECT title FROM titles AS t
      -- referencing outside - correlated subquery
      WHERE t.emp_no = s.emp_no AND t.from_date = s.from_date
    )
FROM salaries AS s
ORDER BY emp_no
LIMIT 5

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[(10001, 60117, datetime.date(1986, 6, 26), 'Senior Engineer'),
 (10001, 62102, datetime.date(1987, 6, 26), None),
 (10001, 66074, datetime.date(1988, 6, 25), None),
 (10001, 66596, datetime.date(1989, 6, 25), None),
 (10001, 66961, datetime.date(1990, 6, 25), None)]

In [84]:
%%sql
-- show the title by salary for each employee
-- same as above cell
-- prefer to use join than subquery (join is faster)
SELECT 
    emp_no,
    salary,
    from_date,
    t.title
FROM salaries AS s
LEFT OUTER JOIN titles AS t USING(emp_no, from_date)
ORDER BY emp_no
LIMIT 5

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[(10001, 60117, datetime.date(1986, 6, 26), 'Senior Engineer'),
 (10001, 62102, datetime.date(1987, 6, 26), None),
 (10001, 66074, datetime.date(1988, 6, 25), None),
 (10001, 66596, datetime.date(1989, 6, 25), None),
 (10001, 66961, datetime.date(1990, 6, 25), None)]

In [86]:
%%sql

select emp_no, salary, from_date, 
    (select title from titles as t 
        where t.emp_no=s.emp_no and 
    (t.from_date = s.from_date + interval '2 days' or t.from_date=s.from_date))
from salaries as s
order by emp_no
limit 5

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[(10001, 60117, datetime.date(1986, 6, 26), 'Senior Engineer'),
 (10001, 62102, datetime.date(1987, 6, 26), None),
 (10001, 66074, datetime.date(1988, 6, 25), None),
 (10001, 66596, datetime.date(1989, 6, 25), None),
 (10001, 66961, datetime.date(1990, 6, 25), None)]

### getting the latest salaries

In [89]:
%%sql

EXPLAIN ANALYSE
SELECT 
    emp_no,
    salary AS "most recent salary",
    from_date
FROM salaries AS s
WHERE from_date = (
  SELECT MAX(from_date)
  FROM salaries AS sp
  -- correlated subquery
  WHERE sp.emp_no = s.emp_no
)

ORDER BY emp_no ASC
LIMIT 5

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
13 rows affected.

[('Limit  (cost=0.43..834.75 rows=5 width=12) (actual time=0.079..0.165 rows=5 loops=1)',),
 ('  ->  Index Scan using salaries_pkey on salaries s  (cost=0.43..2372806.60 rows=14220 width=12) (actual time=0.078..0.163 rows=5 loops=1)',),
 ('        Filter: (from_date = (SubPlan 2))',),
 ('        Rows Removed by Filter: 54',),
 ('        SubPlan 2',),
 ('          ->  Result  (cost=0.78..0.79 rows=1 width=4) (actual time=0.002..0.002 rows=1 loops=59)',),
 ('                InitPlan 1 (returns $1)',),
 ('                  ->  Limit  (cost=0.43..0.78 rows=1 width=4) (actual time=0.002..0.002 rows=1 loops=59)',),
 ('                        ->  Index Only Scan Backward using salaries_pkey on salaries sp  (cost=0.43..4.67 rows=12 width=4) (actual time=0.002..0.002 rows=1 loops=59)',),
 ('                              Index Cond: ((emp_no = s.emp_no) AND (from_date IS NOT NULL))',),
 ('                              Heap Fetches: 0',),
 ('Planning Time: 0.158 ms',),
 ('Execution Time: 0.224 ms',)]

In [92]:
%%sql
-- same as above cell but slower
EXPLAIN ANALYSE
SELECT 
    emp_no,
    salary AS "most recent salary",
    from_date
FROM salaries AS s

JOIN last_salary_change AS ls USING(emp_no)
WHERE from_date = ls.max
ORDER BY emp_no ASC
LIMIT 5

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
29 rows affected.

[('Limit  (cost=2.92..2910.47 rows=5 width=12) (actual time=0.436..0.479 rows=5 loops=1)',),
 ('  ->  Merge Join  (cost=2.92..347164.00 rows=597 width=12) (actual time=0.435..0.478 rows=5 loops=1)',),
 ('        Merge Cond: (e.emp_no = s.emp_no)',),
 ('        Join Filter: (s.from_date = (max(s_1.from_date)))',),
 ('        Rows Removed by Join Filter: 54',),
 ('        ->  GroupAggregate  (cost=2.49..171107.03 rows=300024 width=8) (actual time=0.095..0.118 rows=5 loops=1)',),
 ('              Group Key: e.emp_no',),
 ('              ->  Merge Join  (cost=2.49..152389.80 rows=3143397 width=8) (actual time=0.081..0.108 rows=60 loops=1)',),
 ('                    Merge Cond: (e.emp_no = s_1.emp_no)',),
 ('                    ->  Nested Loop  (cost=1.30..30631.42 rows=331603 width=8) (actual time=0.066..0.081 rows=6 loops=1)',),
 ('                          ->  Merge Join  (cost=1.16..22781.98 rows=331603 width=13) (actual time=0.042..0.045 rows=6 loops=1)',),
 ('                                Merge Cond: (de.emp_no = e.emp_no)',),
 ('                                ->  Index Only Scan using dept_emp_pkey on dept_emp de  (cost=0.42..10086.47 rows=331603 width=9) (actual time=0.023..0.023 rows=6 loops=1)',),
 ('                                      Heap Fetches: 0',),
 ('                                ->  Index Only Scan using employees_pkey on employees e  (cost=0.42..7800.78 rows=300024 width=4) (actual time=0.014..0.015 rows=6 loops=1)',),
 ('                                      Heap Fetches: 0',),
 ('                          ->  Memoize  (cost=0.15..0.16 rows=1 width=20) (actual time=0.005..0.005 rows=1 loops=6)',),
 ('                                Cache Key: de.dept_no',),
 ('                                Cache Mode: logical',),
 ('                                Hits: 2  Misses: 4  Evictions: 0  Overflows: 0  Memory Usage: 1kB',),
 ('                                ->  Index Only Scan using departments_pkey on departments d  (cost=0.14..0.15 rows=1 width=20) (actual time=0.006..0.006 rows=1 loops=4)',),
 ('                                      Index Cond: (dept_no = de.dept_no)',),
 ('                                      Heap Fetches: 4',),
 ('                    ->  Index Only Scan using salaries_pkey on salaries s_1  (cost=0.43..73865.13 rows=2844047 width=8) (actual time=0.014..0.019 rows=60 loops=1)',),
 ('                          Heap Fetches: 0',),
 ('        ->  Materialize  (cost=0.43..116529.32 rows=2844047 width=12) (actual time=0.331..0.349 rows=59 loops=1)',),
 ('              ->  Index Scan using salaries_pkey on salaries s  (cost=0.43..109419.20 rows=2844047 width=12) (actual time=0.326..0.334 rows=59 loops=1)',),
 ('Planning Time: 1.107 ms',),
 ('Execution Time: 0.607 ms',)]

### Subquery Exercise

In [95]:
%%sql
/* TRY TO WRITE THESE AS JOINS FIRST */
/*
* DB: Employees
* Table: employees
* Question: Filter employees who have emp_no 110183 as a manager
*/

SELECT emp_no, first_name, last_name
FROM employees
WHERE emp_no IN (
    SELECT emp_no
    FROM dept_emp
    WHERE dept_no = (
        SELECT dept_no 
        FROM dept_manager
        WHERE emp_no = 110183
    )
)
ORDER BY emp_no
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[(10005, 'Kyoichi', 'Maliniak'),
 (10013, 'Eberhardt', 'Terkki'),
 (10036, 'Adamantios', 'Portugali'),
 (10039, 'Alejandro', 'Brender'),
 (10054, 'Mayumi', 'Schueller')]

In [96]:
%%sql
-- Written with JOIN
SELECT e.emp_no, first_name, last_name
FROM employees as e
JOIN dept_emp as de USING (emp_no)
JOIN dept_manager as dm USING (dept_no)
WHERE dm.emp_no = 110183
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[(10005, 'Kyoichi', 'Maliniak'),
 (10013, 'Eberhardt', 'Terkki'),
 (10036, 'Adamantios', 'Portugali'),
 (10039, 'Alejandro', 'Brender'),
 (10054, 'Mayumi', 'Schueller')]

In [97]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/Store')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [99]:
%%sql
/*
* DB: Store
* Table: orders
* Question: Get all orders from customers who live in Ohio (OH), New York (NY) or Oregon (OR) state
* ordered by orderid
*/

SELECT c.firstname, c.lastname, o.orderid 
FROM orders AS o, (
    SELECT customerid, state, firstname, lastname
    FROM customers
) AS c
WHERE  o.customerid = c.customerid AND 
c.state IN ('NY', 'OH', 'OR')
ORDER BY o.orderid
LIMIT 5;

   postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/France
 * postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[('OVPMOP', 'LIZZSSPEUH', 21),
 ('NXMRSM', 'OMLTJEVRKL', 61),
 ('MTMDYO', 'JTFLKCXVWN', 73),
 ('JLVOXI', 'RKGPOJENXM', 103),
 ('TSBVZP', 'NYNLCPXJAS', 131)]